<a href="https://colab.research.google.com/github/SihyunPark01/AI_WEB/blob/main/pandas%20/%20%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%8B%A4%EB%A3%A8%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# 표 데이터를 쉽게 다룰 수 있는 도구 : pandas 따라서 판다스를 배우는 이유는 데이터를 쉽게 다루고 싶기 때문에!
# pandas, numpy, spark, excel, google sheets, plotly, matplotlib, seaborn, scikits learn
# 데이터를 다루기 위해 필요한 능력들 : 데이터 불러오기 / 데이터 상태 파악하기 / Row,Column 선택하기 / 원하는 데이터 찾기 - query/search / 집계하기 & 그룹으로 묶기 / 합치기

# 데이터 불러오기 / 파악하기
import pandas as pd
path = 'https://raw.githubusercontent.com/blackdew/ml-tensorflow/master/data/csv/lemonade.csv'   #url도 가능하고 로컬주소도 가능함
df = pd.read_csv(path)

In [ ]:
print(df.shape) # .shape ; row의 개수 6, column의 개수 2
df.info() # .info() ; 표의 대략적인 정보 파악

(6, 2)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   온도      6 non-null      int64
 1   판매량     6 non-null      int64
dtypes: int64(2)
memory usage: 224.0 bytes

In [ ]:
df.head() # 맨 위의 데이터 출력

   온도  판매량
0  20   40
1  21   42
2  22   44
3  23   46
4  24   48

In [ ]:
df.tail()  # 맨 아래의 데이터 출력

   온도  판매량
1  21   42
2  22   44
3  23   46
4  24   48
5  25   50

In [ ]:
df.columns #column들의 이름을 리스트로 출력

Index(['온도', '판매량'], dtype='object')

In [ ]:
# DataFrame --- column들 하나하나가 모이면 series... series들을 모아놓은 것이 dataframe.
# 여러 개의 column으로 구성된 2차원 형태의 자료구조, row와 column으로 이루어진 table형태의 데이터 객체

In [ ]:
import pandas as pd
path = 'https://raw.githubusercontent.com/blackdew/ml-tensorflow/master/data/csv/boston.csv'
df = pd.read_csv(path)

In [ ]:
print(df.shape)
df.info()

(506, 14)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   crim     506 non-null    float64
 1   zn       506 non-null    float64
 2   indus    506 non-null    float64
 3   chas     506 non-null    int64
 4   nox      506 non-null    float64
 5   rm       506 non-null    float64
 6   age      506 non-null    float64
 7   dis      506 non-null    float64
 8   rad      506 non-null    int64
 9   tax      506 non-null    int64
 10  ptratio  506 non-null    float64
 11  b        506 non-null    float64
 12  lstat    506 non-null    float64
 13  medv     506 non-null    float64
dtypes: float64(11), int64(3)
memory usage: 55.5 KB

In [ ]:
df.head()
df.tail()

        crim   zn  indus  chas    nox  ...  tax  ptratio       b  lstat  medv
501  0.06263  0.0  11.93     0  0.573  ...  273     21.0  391.99   9.67  22.4
502  0.04527  0.0  11.93     0  0.573  ...  273     21.0  396.90   9.08  20.6
503  0.06076  0.0  11.93     0  0.573  ...  273     21.0  396.90   5.64  23.9
504  0.10959  0.0  11.93     0  0.573  ...  273     21.0  393.45   6.48  22.0
505  0.04741  0.0  11.93     0  0.573  ...  273     21.0  396.90   7.88  11.9

[5 rows x 14 columns]

In [ ]:
df.columns

Index(['crim', 'zn', 'indus', 'chas', 'nox', 'rm', 'age', 'dis', 'rad', 'tax',
       'ptratio', 'b', 'lstat', 'medv'],
      dtype='object')